---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Field.SubEntityReadAccessGranted
source: html/106283c6-a5ad-4a27-855f-cf310d632583.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.SubEntityReadAccessGranted Method

Checks whether there is read access to subentities storable in this field.

## Syntax (C#)
```csharp
public bool SubEntityReadAccessGranted()
```

## Returns
True if subentities are readable.